// Вывести на экран число «ПИ» с точностью до сотых.

double pi = Math.PI;
Console.WriteLine("{0: 0.00}", pi);