// Вывести на экран число e (основание натурального логарифма) с точностью до десятых.

double e = Math.E;
Console.WriteLine("{0:0.0}", e);
