// Составить программу вывода на экран «столбиком» пяти любых чисел, введенных пользователем с клавиатуры. 

Console.WriteLine("Введите первое число: ");
int a = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите второе число: ");
int b = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите третье число: ");
int c = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите четвертое число: ");
int d = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите пятое число");
int e = Convert.ToInt32(Console.ReadLine());

Console.WriteLine("Ответ на поставленную задачу:");
Console.WriteLine(a);
Console.WriteLine(b);
Console.WriteLine(c);
Console.WriteLine(d);
Console.WriteLine(e);
